In [1]:
import numpy as np
import pandas as pd

In [2]:
np.random.seed(101)

In [4]:
df = pd.DataFrame(np.random.randn(5,4), ['A', 'B', 'C', 'D', 'E'], ['W', 'X', 'Y', 'Z'])

In [5]:
df

          W         X         Y         Z
A  0.302665  1.693723 -1.706086 -1.159119
B -0.134841  0.390528  0.166905  0.184502
C  0.807706  0.072960  0.638787  0.329646
D -0.497104 -0.754070 -0.943406  0.484752
E -0.116773  1.901755  0.238127  1.996652

In [7]:
# conditional selection -> very similar to numpy
booldf = df > 0

In [8]:
booldf

       W      X      Y      Z
A   True   True  False  False
B  False   True   True   True
C   True   True   True   True
D  False  False  False   True
E  False   True   True   True

In [9]:
df[booldf]

          W         X         Y         Z
A  0.302665  1.693723       NaN       NaN
B       NaN  0.390528  0.166905  0.184502
C  0.807706  0.072960  0.638787  0.329646
D       NaN       NaN       NaN  0.484752
E       NaN  1.901755  0.238127  1.996652

In [10]:
df[df > 0]

          W         X         Y         Z
A  0.302665  1.693723       NaN       NaN
B       NaN  0.390528  0.166905  0.184502
C  0.807706  0.072960  0.638787  0.329646
D       NaN       NaN       NaN  0.484752
E       NaN  1.901755  0.238127  1.996652

In [14]:
df

          W         X         Y         Z
A  0.302665  1.693723 -1.706086 -1.159119
B -0.134841  0.390528  0.166905  0.184502
C  0.807706  0.072960  0.638787  0.329646
D -0.497104 -0.754070 -0.943406  0.484752
E -0.116773  1.901755  0.238127  1.996652

In [12]:
df['W'] > 0

A     True
B    False
C     True
D    False
E    False
Name: W, dtype: bool

In [13]:
df[df['W'] > 0]
# this is most used

          W         X         Y         Z
A  0.302665  1.693723 -1.706086 -1.159119
C  0.807706  0.072960  0.638787  0.329646

In [17]:
resultdf = df[df['Z'] < 0]
resultdf

          W         X         Y         Z
A  0.302665  1.693723 -1.706086 -1.159119

In [18]:
resultdf['X']

A    1.693723
Name: X, dtype: float64

In [20]:
# can be done in single step
df[df['W'] > 0]['X']

A    1.693723
C    0.072960
Name: X, dtype: float64

In [21]:
df[df['W'] > 0][['Y', 'X']]

          Y         X
A -1.706086  1.693723
C  0.638787  0.072960

In [23]:
# using multiple conditions
df[(df['W'] > 0) & (df['Y'] > 1)] # cannot use and bcoz of ambigous values in truth series

Empty DataFrame
Columns: [W, X, Y, Z]
Index: []

In [24]:
df[(df['W'] > 0) | (df['Y'] > 1)] # cannot use or

          W         X         Y         Z
A  0.302665  1.693723 -1.706086 -1.159119
C  0.807706  0.072960  0.638787  0.329646

In [25]:
# resetting index to something else
df

          W         X         Y         Z
A  0.302665  1.693723 -1.706086 -1.159119
B -0.134841  0.390528  0.166905  0.184502
C  0.807706  0.072960  0.638787  0.329646
D -0.497104 -0.754070 -0.943406  0.484752
E -0.116773  1.901755  0.238127  1.996652

In [28]:
df.reset_index() # not inplace, can be made inplace by setting inplace = True

  index         W         X         Y         Z
0     A  0.302665  1.693723 -1.706086 -1.159119
1     B -0.134841  0.390528  0.166905  0.184502
2     C  0.807706  0.072960  0.638787  0.329646
3     D -0.497104 -0.754070 -0.943406  0.484752
4     E -0.116773  1.901755  0.238127  1.996652

In [29]:
newind = 'CA NY WY OR CO'.split()

In [30]:
newind

['CA', 'NY', 'WY', 'OR', 'CO']

In [31]:
df['States'] = newind

In [32]:
df

          W         X         Y         Z States
A  0.302665  1.693723 -1.706086 -1.159119     CA
B -0.134841  0.390528  0.166905  0.184502     NY
C  0.807706  0.072960  0.638787  0.329646     WY
D -0.497104 -0.754070 -0.943406  0.484752     OR
E -0.116773  1.901755  0.238127  1.996652     CO

In [33]:
# setting a column of a df to be an index
df.set_index('States') # not inplace, can be made inplace by setting inplace = True

               W         X         Y         Z
States
CA      0.302665  1.693723 -1.706086 -1.159119
NY     -0.134841  0.390528  0.166905  0.184502
WY      0.807706  0.072960  0.638787  0.329646
OR     -0.497104 -0.754070 -0.943406  0.484752
CO     -0.116773  1.901755  0.238127  1.996652

In [ ]:
# note that original index is lost